tap "asmvik/formulae"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "slp/krunkit"
tap "teamookla/speedtest"
# Simple, modern, secure file encryption
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Apache CloudStack CloudMonkey CLI
brew "cloudmonkey"
# Container Signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line tool for VMware vSphere
brew "govc"
# OpenTelemetry Collector distribution with programmable pipelines
brew "grafana-alloy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Run local Kubernetes cluster in Docker
brew "kind"
# CloudNativePG plugin for kubectl
brew "kubectl-cnpg"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# CLI for interacting with Grafana Mimir
brew "mimirtool"
# Run a Kubernetes cluster locally
brew "minikube"
# Automated testing for Ansible roles
brew "molecule"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# AI coding agent, built for the terminal
brew "opencode"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Tool for managing OCI containers and pods
brew "podman"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Utility to support moving and resizing using a modifier key and mouse drag
cask "easy-move+resize"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Native desktop AI assistant from Google
cask "google-gemini"
# Optimise and personalise your Jabra headset
cask "jabra-direct"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Adaptive brightness for external displays
cask "lunar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Team communication and collaboration software
cask "slack"
# Virtual machines UI using QEMU
cask "utm"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "AdBlock", id: 1402042596
mas "Brother iPrint&Scan", id: 1193539993
mas "Developer", id: 640199958
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "SponsorBlock", id: 1573461917
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "adamhartford.vscode-base64"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "opentofu.vscode-opentofu"
vscode "redhat.vscode-yaml"
go "golang.org/x/tools/gopls"
